In [2]:
import pandas as pd
import numpy as np

In [19]:
df = pd.read_csv('https://raw.githubusercontent.com/jorisvandenbossche/pandas-tutorial/master/data/titanic.csv', header = 0, names = ['Номер',
                 'Класс', 'Имя', 'Пол', 'Возраст', 'Статус', 'Парч', 'Билет', 'Тариф', 'Кабина', 'Отправление'])

In [20]:
df

,Номер,Класс,Имя,Пол,Возраст,Статус,Парч,Билет,Тариф,Кабина,Отправление
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Номер        891 non-null    int64
 1   Класс        891 non-null    int64
 2   Имя          891 non-null    object
 3   Пол          891 non-null    object
 4   Возраст      714 non-null    float64
 5   Статус       891 non-null    int64
 6   Парч         891 non-null    int64
 7   Билет        891 non-null    object
 8   Тариф        891 non-null    float64
 9   Кабина       204 non-null    object
 10  Отправление  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [24]:
df.shape

(891, 11)

In [26]:
df.columns

Index(['Номер', 'Класс', 'Имя', 'Пол', 'Возраст', 'Статус', 'Парч', 'Билет',
       'Тариф', 'Кабина', 'Отправление'],
      dtype='object')

In [27]:
df.head(3)

,Номер,Класс,Имя,Пол,Возраст,Статус,Парч,Билет,Тариф,Кабина,Отправление
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [28]:
df.tail(4)

,Номер,Класс,Имя,Пол,Возраст,Статус,Парч,Билет,Тариф,Кабина,Отправление
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [30]:
df.dtypes

Номер            int64
Класс            int64
Имя             object
Пол             object
Возраст        float64
Статус           int64
Парч             int64
Билет           object
Тариф          float64
Кабина          object
Отправление     object
dtype: object

In [32]:
df['Имя']

1                                Braund, Mr. Owen Harris
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                               Allen, Mr. William Henry
                             ...
887                                Montvila, Rev. Juozas
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
890                                Behr, Mr. Karl Howell
891                                  Dooley, Mr. Patrick
Name: Имя, Length: 891, dtype: object

In [33]:
df['Имя'].head(3)

1                              Braund, Mr. Owen Harris
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
Name: Имя, dtype: object

In [37]:
type(df['Имя'])

pandas.core.series.Series

(891,)